# Определить индексы элементов массива (списка), значения которых принадлежат заданному 
# диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Input: [-5, 9, 0, 3, -1, 2, 1, 4, -2, 10, 2, 0, -9, -8, 10, 9, 0, 5, -5, 7]
# Output: 1, 9, 13, 14, 19

def indexrange(array, minn, maxx):
    result = []
    for i in range(len(array)):
        if minn <= array[i] <= maxx:
            i += 1
            result.append(i)
    return result
    
list = [-5, 9, 0, 3, -1, 2, 1, 4, -2, 10, 2, 0, -9, -8, 10, 9, 0, 5, -5, 7]
print(indexrange(list, -9, -2))

